package com.example.cs;

public class 자바8 {
    /*Java 8은 가장 큰 변화가 있던 버전
    *
    * 자바로 구현하기 힘들었던 병렬 프로세싱을 활용할 수 있게 되었음.
    *
    * 시대가 발전하면서 이제 PC에서 멀티 코어 이상은 대중화 되었다.
    *
    * 이제 수많은 데이터를 효율적으로 처리하기 위해서 ''병렬처리는 필수적
    *
    * 자바 프로그래밍은 다른 언어에 배해서 병렬 처리가 쉽지 않다.
    * 물론, 스레드를 사용하면 놓고 있는 유휴 코어를 활용할 수 있다
    * (ex : 스레드 풀)
    *
    * 하지만 개발자가 관리하기 어렵고, 사용하면서 많은 에러가 발생할 수 있는 단점이 존재한다.
    *
    * 이를 해결하기 위해 8버전에서는 좀 더 개발자들이 병렬 처리를 쉽고 간단하게 할 수 있도록
    * 기능들이 추가 되었다.
    *
    * 대표적인 3가지
    *
    * Stream Api
    * Method Reference & Lamda
    *
    * Default Method
    * */
}
