package com.example.cs;

public class 직렬화 {
    //직렬화
    //---------------------------------------------------------------------------------------------------------------------------------

    /* 자바 시스템 내부에서 사용되는 객체 또는 데이터를 외부의 자바 시스템에서도 사용할 수 있도록
    * 바이트(byte) 형태로 데이터 변환하는 기술*/

    /*각자의 PC의 OS 마다 서로 가상 메모리 주소 공간을 갖기 때문에, Reference Type의 데이터들은 인스턴스를
    * 전달 할 수 없다.
    *
    * 따라서, 이런 문제를 해결하기 위해서 주소값이 아닌 Byte 형태로 직렬화 된 객체 데이터를 전달해야 한다.
    *
    *직렬화 데이터들은 모두 기본형(Primitive Type)이 되고 , 이는 파일 저장이나 네트워크 전송시 파싱이 가능한
    * 유의미한 데이터가 된다. 따라서, 전송 및 저장이 가능한 데이터로 만들어 주는 것이 바로 직렬화(Serialization)이라고 할 수 있다.
    */

    //직렬화 조건
    //---------------------------------------------------------------------------------------------------------------------------------

    /*자바에서는 간단히 java.io.*/

    //---------------------------------------------------------------------------------------------------------------------------------
}
